{
    "id": "tetromania",
    "image": "/Projects/tetromania/tetromania.png",
    "name": "Tetromania",
    "subtitle": "A minimal Tetris game made with Unity.",
    "titleImg": "/Projects/tetromania/tetromania.png",
    "heroImage": {
        "src": "/Projects/tetromania/tetromania.png",
        "alt": "Tetromania"
    },  
    "type": "game",
    "techStack": {
        "frameworks": [
            "C#",
            "Unity 2D"
        ],
        "database": [],
        "tools": []
    },
    "desc": "A minimal and straightforward Tetris game with callibrated swipe controls and fun sound effects.",
    "introText": " Dissatisfied with the existing Tetris games on the Play Store, I wanted to make my own with controls and swipe gestures that fit nicely with the game. I followed a YouTube tutorial to learn the basics of how a Tetris game is developed and incorporated my own touch controls and gestures, along with sound effects, personalized to my own liking. The project was quite a learning journey for me and was quite satisfying to see the end result.",
    "techImg": "/Projects/tetromania/techImg.png",
    "techHead": "Unity 2D",
    "techText": "The game was developed in C# with Unity using the simple Unity 2D template as a starting point. The sprites and the game assets for the tetrominos and sound effects were made using MS Paint along with the background and the frame.",
    "structureText": "<p><strong>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Scripts (./Tetromino):&nbsp;</strong></p><p> This directory contains the scripts that control the game’s entire logic and behavior.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Board.cs: Controls the game board, including the placement and movement of Tetromino pieces as well as clearing once a line is complete, ending the game, increasing the levels, and incrementing the score.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Piece.cs: Defines the properties and behaviors of individual Tetromino pieces based on the different shapes stored in the Data.cs file.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Swipe.cs: Handles user input, such as swiping to move pieces.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Track.cs: Maintains game states such as score and level info.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ButtonScript.cs: Handles the menu button behavior.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data.cs: Stores different tetromino configurations along with some other useful vectors used throughout the game.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ghost.cs: Controls the ghost feature in Tetris that shows where a piece will land.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;camAnim.cs: Controls camera animations when the player hard-falls the tetromino.</p><p> </p><p> </p><p><strong>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Scenes (./Scenes):&nbsp;</strong></p><p> These are the different scenes or screens in the game.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Game.unity: The main game scene where gameplay occurs.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;GameEnd.unity: The scene displayed when a game ends; It showing scores and a replay button.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Start.unity: The initial scene shown to players containing the game start button.</p><p><br></p><p><strong>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sprites (./Sprites and ./Sprites_):&nbsp;</strong></p><p>These directories contain the visual assets used in the game, such as the different colored blocks for each Tetromino piece and the game grid.</p><p><strong>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Buttons (./Buttons):&nbsp;</strong></p><p> Contains the assets for the button used in the game.</p><p><strong>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sounds (./CasualGameSounds):&nbsp;</strong></p><p> Contains the sound effects for your game.</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Tiles (./Tiles):&nbsp;</strong></p><p>This directory likely contains the tiled assets for the individual tiles that make up the",
    "assetText": "The game graphical assets are quite simple and were made in MS Paint. There are multiple colors for the tetromino blocks and for the grid and ghost tetrominos as well. There is no background music but there are various sound effects throughout the game that trigger on rotation, line clears, and hard falls.",
    "assetFull": "yes",
    "assets": [
        "/Projects/tetromania/asset_1.png"
    ],
    "screenshots": [
        "/Projects/tetromania/screenshot1.png",
        "/Projects/tetromania/screenshot2.png",
        "/Projects/tetromania/screenshot3.png",
        "/Projects/tetromania/screenshot4.png"
    ],
    "youtubeLink": "https://www.youtube.com/embed/3PUxZxfQ4CI?si=dfzg4aA3bE3AGlUX",
    "lessonsLearned": "<p>Throughout the development, several challenges were encountered, leading to valuable learning experiences. </p><p><br></p><p>Perhaps learning how to implement rotation and kickbacks was a bit challenging at first as it took a lot of trial and error to get things right. </p><p><br></p><p>As for creating visually appealing sprites and art, particularly with respect to how much contrast there should be in the colours, proved to be a fun experience.</p><p><br></p><p>The process of programming the game's swipe gestures and calibrating them for the smoothest user experience was also something that took a lot of trial and error to implement, but eventually ended up learning a lot about the of swipe based controls.</p>",
    "links": [
        "https://github.com/saadhzubairi/Tetromania.git"
    ]
}