[
    {
        "desg": "Software Engineer Intern",
        "company": "Cloaked Inc.",
        "years": "June 2025 – August 2025",
        "logo": "/XP_logos/cloaked.png",
        "website": "https://www.cloaked.com/",
        "linkedIn": "https://www.linkedin.com/company/cloaked/",
        "about": "Cloaked Inc. is a privacy-first technology company enabling individuals and businesses to manage, mask, and control their personal data through advanced privacy infrastructure, AI-driven solutions, and secure communication tools.",
        "desc": "Worked as a Software Engineer Intern delivering high-impact automation tools, geospatial dashboards, and LLM-powered customer support solutions.",
        "resps": [
            "Extracted and geocoded 2,000+ mailbox locations from Anytime Mailbox via Puppeteer (with exponential-backoff, <2% failures) and visualized them in a Next.js/OpenLayers dashboard for one-click CSV/PDF exports.",
            "Shipped a RAG-powered Zendesk auto-tagging Chrome extension that processed 1,200 weekly support tickets with 92% tagging accuracy (P=0.92, R=0.88; n=1,238), cutting average triage time from 6 hours to 2 hours.",
            "Developed an LLM-based MVP cybersecurity training tool using Nuxt.js, delivering multiple interactive learning modules via a modular generative component-based interface."
        ],
        "skills": [
            "Next.js",
            "OpenLayers",
            "Nuxt.js",
            "Puppeteer",
            "RAG",
            "LLM Applications",
            "Chrome Extensions",
            "Geospatial Visualization",
            "TypeScript"
        ]
    },
    {
        "desg": "Student Software Engineer",
        "company": "New York University",
        "years": "April 2025 – Present",
        "logo": "/EDXP_logos/NYU.png",
        "website": "https://www.nyu.edu/",
        "linkedIn": "https://www.linkedin.com/school/new-york-university/",
        "about": "New York University (NYU) is a global research university with campuses in New York City, Abu Dhabi, and Shanghai, renowned for academic excellence and innovation.",
        "desc": "Part of the university's software engineering team, modernizing critical academic portals and implementing advanced access control and scheduling systems.",
        "resps": [
            "Led migration of a legacy PHP-based placement exam site into a modern T3-stack portal, unifying scheduling, grading, and placement/exemption requests, supporting 2,500+ exam submissions per term.",
            "Implemented custom DAL and BAL in T3-stack portal with 4-tier RBAC via Prisma ORM.",
            "Added conflict detection to existing portals, reducing double-booking incidents by 99% among 5,000 users."
        ],
        "skills": [
            "T3-stack",
            "Prisma ORM",
            "TypeScript",
            "Role-Based Access Control (RBAC)",
            "Full-Stack Development",
            "Legacy System Migration"
        ]
    },
    {
        "desg": "Software Engineer",
        "company": "Sadiq.ai",
        "years": "May 2024 – August 2024",
        "logo": "/XP_logos/sadiq.jpeg",
        "website": "https://sadiq.ai/",
        "linkedIn": "https://www.linkedin.com/company/sadiq-ai",
        "about": "Sadiq.ai is an innovative tech startup specializing in AI-driven solutions for the healthcare industry. The company is dedicated to building cutting-edge products that enhance medical processes and improve patient outcomes.",
        "desc": "Led the engineering and deployment of the SupportSphere MVP in a high-paced healthcare startup environment.",
        "resps": [
            "Led a 5-engineer scrum, shipped SupportSphere MVP in 8 weeks, and ran tri-weekly clinician feedback demos.",
            "Streamlined development workflow by lazy-loading major Next.js routes and implementing all core Nest.js endpoints.",
            "Optimized front-end components in Next.js and developed 90% of back-end services using Nest.js.",
            "Provisioned via Terraform (6 low-tier EC2/RDS instances) and set up GitHub Actions for automated MVP deployments."
        ],
        "skills": [
            "Team Leadership",
            "Next.js",
            "Nest.js",
            "TypeScript",
            "Terraform",
            "AWS EC2",
            "AWS RDS",
            "GitHub Actions",
            "Healthcare Technology"
        ]
    },
    {
        "desg": "Software Engineer",
        "company": "United Bank Limited",
        "years": "July 2023 – April 2024",
        "logo": "/XP_logos/united_bank_limited_logo.jpeg",
        "website": "https://www.ubldigital.com/",
        "linkedIn": "https://www.linkedin.com/company/united-bank-limited",
        "about": "United Bank Limited (UBL) is a prominent financial institution headquartered in Karachi, Pakistan. Established in 1959, UBL has grown into a leading bank, providing a wide range of financial services globally. With a focus on innovation and customer satisfaction, UBL plays a vital role in the economic development of Pakistan.",
        "desc": "Worked in UBL's core banking and payment systems division, modernizing and optimizing Temenos-based services.",
        "resps": [
            "Authored and migrated 12 account-management and 18 payment reconciliation endpoints in Java/Temenos, reducing integration lead time by 60% and lowering API error rate to <0.5%.",
            "Designed and maintained all multi-threaded Java services within Unix-based Temenos systems."
        ],
        "skills": [
            "Java",
            "Temenos Infinity",
            "Temenos Core Banking",
            "Unix Systems",
            "Payment Reconciliation",
            "API Development"
        ]
    },
    {
        "desg": "Junior Software Developer",
        "company": "MCB Funds",
        "years": "May 2023 - July 2023",
        "logo": "/XP_logos/mcbfunds_logo.jpeg",
        "website": "https://www.mcbfunds.com/",
        "linkedIn": "https://www.linkedin.com/company/mcbfunds/",
        "about": "MCB Funds is an Asset Management Company, listed on the Pakistan Stock Exchange and regulated under the Securities & Exchange Commission of Pakistan (SECP). The Company was established in the year 2000 and in March 2002, two of its flagship Funds, the MCB Pakistan Stock Market Fund (MCB-PSM) and the Pakistan Income Fund (PIF) were launched. MCB Funds manages 15 Mutual Funds, 2 Voluntary Pension schemes and various Investment Plans in its product portfolio to meet the investment needs of its growing clientele. It is also a member of the Mutual Funds Association of Pakistan (MUFAP). MCB Funds has the highest management quality rating of AM1, which bespeaks of its excellent management and quality standards in the industry.",
        "desc": "Onboarded as a Junior Software Developer as a lateral hire for the backend operations team after 3 screening rounds.",
        "resps": [
            "Collaborated on updating dependencies of legacy codebase, ensuring the application's maintainability and security.",
            "Developed and implemented file compression utilities, boosting data transfer speeds by 20% and reducing storage requirements by 30%"
        ],
        "skills": [
            "C++",
            "Python",
            "ASP.NET Core",
            "Back-End Development"
        ]
    },
    {
        "desg": "Unity and UI/UX Intern",
        "company": "Run Sports, LLC (New York)",
        "years": "Dec 2022 - Jan 2023",
        "logo": "/XP_logos/run_sports_app_logo.jpeg",
        "website": "https://www.runhoops.com/",
        "linkedIn": "https://www.linkedin.com/company/run-sports-app/",
        "about": "RUN Sports is a technology company that is digitally reinventing player pick-up sports by enabling users of our mobile application to find, create and play in local pick-up games. Our Intelligent Roster System™ embedded in our App helps our players avoid pick-up games that are not competitively balanced or appropriate for the particular player, which helps solve a common occurrence when new players try to connect to play games. In addition, our App allows our players to communicate with other players via the chat function, and receive rewards such as badges and a gamer score by staying active. Our players think of our App as a real life version of the My Player mode found in the NBA 2K video game series.",
        "desc": "Onboarded as a Unity Intern for the wintern internship cohort through wellfound (formerly angel.co).",
        "resps": [
            "Designed 15 user journey wireframes, prototypes, and mockups for a gamified social media app using Figma.",
            "Elevated engagement and retention by 37% by introducing a reward system and a leaderboard experience.",
            "Programmed 20+ interactive UI elements and 5+ animations in Unity for user interface development.",
            "Worked closely with the engineering team to ensure design specifications were implemented accurately and effectively.",
            "Conducted 3 user research and usability testing to gather feedback and insights."
        ],
        "skills": [
            "Product Design",
            "UX Research",
            "GUI Design",
            "Figma",
            "C#",
            "Unity"
        ]
    },
    {
        "desg": "Game Programming Intern",
        "company": "Mindstorm Studios",
        "years": "July 2022 - Sept 2022",
        "logo": "/XP_logos/mindstorm_studios_logo.jpeg",
        "website": "https://mindstormstudios.com/",
        "linkedIn": "https://www.linkedin.com/company/mindstorm-studios/",
        "about": "We bring fun to life on the mobile with games that entertain millions all around the world. With over 15 years of game development experience and hits in the bag, including critically acclaimed PC titles like Cricket Revolution and the ICC 2011 official world cup cricket game, Cricket Power, we are now focused on disrupting the mobile casual and hypercasual markets with world class game launches and experiences. We are partnered with the top publishers in the mobile gaming world and are leading the charge to make Pakistan a mobile gaming powerhouse!",
        "desc": "Part of the 2022 summer game jam internship program.",
        "resps": [
            "Completed 20 hours of training programs with seasoned game design professionals",
            "Built 3 hands-on game projects to cultivate a solid understanding of the SDLC.",
            "Enhanced Unity and C# scripting abilities through 5+ intermediate level projects.",
            "Lead a team of 4 people to develop a production ready game as our final capstone submission."
        ],
        "skills": [
            "Game Development",
            "Unity",
            "Blender",
            "C++",
            "AI",
            "Algorithms"
        ]
    },
    {
        "desg": "Teaching Assistant",
        "company": "Institute of Business Administration, Karachi",
        "years": "Jan 2021 - May 2023",
        "logo": "/EDXP_logos/IBA.png",
        "website": "https://www.iba.edu.pk/",
        "linkedIn": "https://www.linkedin.com/school/institute-of-business-administration-karachi/",
        "about": "Established in 1955, the Institute of Business Administration (IBA) Karachi stands as a prestigious academic institution in Pakistan. Renowned for its commitment to excellence, IBA offers a diverse range of undergraduate and graduate programs in business, economics, and social sciences. With a rich history, IBA Karachi continues to shape future leaders through rigorous education and a focus on practical skills, contributing significantly to the country's business and academic landscape.",
        "desc": "Teaching assistant for 3 Prgramming and Computer Networking courses and two Faculty Members for 4 semesters",
        "resps": [
            "Facilitated 70+ students with their learning via conducting tutorials and assisting in home-assignments.",
            "Provided timely and frequent feedback to students through exam, quizzes, and assignment reviews.",
            "Assisted the professors in improving the assignments to make sure they fit the students understanding.",
            "Maintained student progress records and efficiently managed any issues faced during online mode classes whenever it was applicable.",
            "Graded 200+ assignments throughout the term, lab tasks, and quizzes."
        ],
        "skills": [
            "Java",
            "Python",
            "Cisco Packet Tracer",
            "Teaching",
            "Lecturing",
            "Grading & Assessment",
            "Academic Bookkeeping"
        ]
    }
]